tutorials/Ti_Validation/3D_Ti_validation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     Flint_multiphaseEulerFoamD;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2e-3;

deltaT          1.0e-6;

writeControl    adjustableRunTime;

writeInterval   1e-04;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;//0.1;
maxAlphaCo      0.2;

maxDeltaT       1e-6;


// ************************************************************************* //
