tutorials/Ti_Validation/3D_Ti_validation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.10                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-6;

vertices
(


    (-200 0 0)//0
    (200 0 0)//1
    (200 400 0)//2
    (-200 400 0)//3
    (-200 0 400)//4
    (200 0 400)//5
    (200 400 400)//6
    (-200 400 400)//7



);
blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 40) simpleGrading (1 1 1)		//REGION 1



);

edges
(
);

boundary
(

    lowerWall
    {
        type wall;
        faces
        (
            (3 7 6 2)

        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    rightWall
    {
        type patch;
        faces
        (
            (1 2 6 5)
	    
        );
    }
    leftWall
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    frontAndBack
    {
        type patch;
        faces
        (
            (0 3 2 1)
	    (5 6 7 4)
        );
    }
);

mergePatchPairs
(


);

// ************************************************************************* //
