tutorials/Ti_Validation/3D_Ti_validation/0/Laser_boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	frontAndBack{
type fixedValue;
value uniform -1.0;
	}

    lowerWall
    {
type fixedValue;
value uniform -1.0;
    }

    atmosphere
    {
type fixedValue;
value uniform 1.0;
    }

rightWall
    {
type fixedValue;
value uniform -1.0;
    }
    leftWall
    {
type fixedValue;
value uniform -1.0;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
